{"html":"<p>In July 2020, after a while thinking about it I decided to ditch my current job. I had a good position, in a really mature and stable company, just got a promotion and I was really happy with colleagues. </p>\n<p>Am I an idiot? <em>Maybe</em>.</p>\n<p>You might be asking why I did this. Well, the answer is not simple. Even thought there were many good things about this job position, I was not happy, I felt I needed to do something different. Since I went out of University I only worked in one place, and I had the impression I was missing something. </p>\n<p>I was getting a bit <em>burned out</em>. Maybe not the kind which you decide to just change completely your career. But the one that makes you stop for a period of time to recover and get motivated again with different projects. </p>\n<p>Right, I could've wait a bit more, at that time we were in the middle of a global pandemic (well, we're still now), but sometimes I think you need to make a step further and just do what you think it's right. </p>\n<h2 id=\"what-i-am-doing-now\">What I am doing now?</h2>\n<p>There was a funny story in HackerNews the other day of a Software Engineer who opened an issue in one Docker repo, after some conversation the guy disappeared, six months later he came back with the following message: </p>\n<blockquote>\n  <p><a href=\"https://github.com/solvaholic\">@solvaholic</a>: Sorry I missed your comment of many months ago. I no longer build software; I now make furniture out of wood. The hours are long, the pay sucks, and there's always the opportunity to remove my finger with a table saw, but nobody asks me if I can add an RSS feed to a DBMS, so there's that :-)</p>\n</blockquote>\n<p>Link: <a href=\"https://github.com/docker/cli/issues/267#issuecomment-695149477\">https://github.com/docker/cli/issues/267#issuecomment-695149477</a></p>\n<p>So the guy got burned out and decided to change career and do wood working. More or less I am currently in that mood, basically, doing stuff I had in my mind for a while and I hadn't have time before. I have no plans to change careers as I really like software development, but I will tend to do more <em>real</em> stuff. </p>","metadata":{"title":"I quit my five-star job","summary":"Why I did this to myself","date":"2020-11-05T00:00:00.000Z","tags":"career","draft":false,"slug":"i-quit-my-five-star-job"},"filename":"i-quit-my-job.md","path":"/home/runner/work/alextorres.me/alextorres.me/src/posts/i-quit-my-job.md"}